terjeio/grblHAL/drivers/MSP430F5529/driver.c
/* The Stepper Port Reset Interrupt: This interrupt handles the falling edge of the step
   pulse. This should always trigger before the next general stepper driver interrupt and independently
   finish, if stepper driver interrupts is disabled after completing a move.
   NOTE: Interrupt collisions between the serial and stepper interrupts can cause delays by
   a few microseconds, if they execute right before one another. Not a big deal, but can
   cause issues at high step rates if another high frequency asynchronous interrupt is
   added to Grbl.
*/
// This interrupt is enabled when Grbl sets the motor port bits to execute
// a step. This ISR resets the motor port after a short period (settings.pulse_microseconds)
// completing one step cycle.
// NOTE: MSP430 has a shared interrupt for match and timeout

#pragma vector=PULSE_TIMER0_VECTOR
__interrupt void stepper_pulse_isr (void)
{
    set_step_outputs(settings.steppers.step_invert);
    PULSE_TIMER_CTL &= ~(MC0|MC1);
}

#pragma vector=PULSE_TIMER1_VECTOR
__interrupt void stepper_pulse_isr_delayed (void)
{
    if(PULSE_TIMER_IV == TA0IV_TACCR1) {
        set_step_outputs(next_step_outbits);
        PULSE_TIMER_CCR0 = PULSE_TIMER_R + step_pulse_ticks;
    }
}

#pragma vector=WDT_VECTOR
__interrupt void software_debounce_isr (void)
{
    if(!--debounce_count) {
        SFRIE1 &= ~WDTIE;
        axes_signals_t state = limitsGetState();
        if(state.value) //TODO: add check for limit swicthes having same state as when limit_isr were invoked?
            hal.limit_interrupt_callback(state);
    }
}

#pragma vector=CONTROL_PORT_VECTOR
__interrupt void control_isr (void)
{
    uint8_t iflags = CONTROL_PORT_IFG & HWCONTROL_MASK;

    if(iflags) {
        CONTROL_PORT_IFG &= ~iflags;
        hal.control_interrupt_callback(systemGetState());
    }
}

#pragma vector=LIMIT_PORT_VECTOR
__interrupt void limit_isr (void)
{
    uint16_t iflags = LIMIT_PORT_IFG & HWLIMIT_MASK;

    if(iflags) {

        LIMIT_PORT_IFG &= ~iflags;

        if(hal.driver_cap.software_debounce) {
            WDTCTL = WDT_ADLY_16;   // Set watchdog timeout to ~16ms
            SFRIE1 |= WDTIE;        // and enable interrupt
            debounce_count = 3;     // Debounce = 3x watchdog timeout
        } else
            hal.limit_interrupt_callback(limitsGetState());
    }
}

// Interrupt handler for 1 ms interval timer
#pragma vector=SYSTICK_TIMER0_VECTOR
__interrupt void systick_isr (void)
{
    delay.ms = 0;
    SYSTICK_TIMER_CTL &= ~(MC0|MC1);
    if(delay.callback) {
        delay.callback();
        delay.callback = NULL;
    }
}
